#### Terraform Plan 📋

<details><summary>Show Plan</summary>

```
random_id.bucket_suffix: Refreshing state... [id=6NXj9w]
data.aws_ami.amazon_linux_x86_nat: Reading...
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::621218322544:oidc-provider/token.actions.githubusercontent.com]
data.aws_ami.amazon_linux_x86: Reading...
aws_s3_bucket.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
data.aws_iam_policy_document.github_actions_assume_role: Reading...
data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=2301905863]
aws_iam_role.github_actions_role: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.github_actions_ec2: Refreshing state... [id=GithubActionsRole-20250611082319393100000002]
aws_iam_role_policy_attachment.github_actions_vpc: Refreshing state... [id=GithubActionsRole-20250611082319541400000003]
aws_iam_role_policy_attachment.github_actions_s3: Refreshing state... [id=GithubActionsRole-20250611082319555700000004]
aws_iam_role_policy_attachment.github_actions_sqs: Refreshing state... [id=GithubActionsRole-20250611082319586400000007]
aws_iam_role_policy_attachment.github_actions_iam: Refreshing state... [id=GithubActionsRole-20250611082319568300000005]
aws_iam_role_policy_attachment.github_actions_route53: Refreshing state... [id=GithubActionsRole-20250611082319581700000006]
aws_iam_role_policy_attachment.github_actions_eventbridge: Refreshing state... [id=GithubActionsRole-20250611082319187100000001]
data.aws_ami.amazon_linux_x86_nat: Read complete after 1s [id=ami-0a3f61f21fa449cda]
data.aws_ami.amazon_linux_x86: Read complete after 1s [id=ami-0a3f61f21fa449cda]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.bastion will be created
  + resource "aws_eip" "bastion" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-bastion-eip"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-bastion-eip"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat_instance will be created
  + resource "aws_eip" "nat_instance" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-nat-eip"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-nat-eip"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip_association.bastion will be created
  + resource "aws_eip_association" "bastion" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_eip_association.nat_instance will be created
  + resource "aws_eip_association" "nat_instance" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0a3f61f21fa449cda"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rsschool-devops-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-bastion-host"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "bastion"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-bastion-host"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "5bb952cba9897eb14ae12d429f882943554e7dfb"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.nat_instance will be created
  + resource "aws_instance" "nat_instance" {
      + ami                                  = "ami-0a3f61f21fa449cda"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rsschool-devops-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-nat-instance"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "nat"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-nat-instance"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "nat"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "06a11f24203378542296d139172593c6a1699c67"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-igw"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-igw"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id   = (known after apply)
    }

  # aws_network_acl.private will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + protocol        = "tcp"
              + rule_no         = 110
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.0.0.0/16"
              + from_port       = 0
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-nacl"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-nacl"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + protocol        = "tcp"
              + rule_no         = 140
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 22
              + protocol        = "tcp"
              + rule_no         = 120
              + to_port         = 22
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + protocol        = "tcp"
              + rule_no         = 110
              + to_port         = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 80
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-nacl"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-nacl"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id     = (known after apply)
    }

  # aws_route.private_nat[0] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_nat[1] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-rt-1"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-rt-1"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-rt-2"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-rt-2"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-rt"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-rt"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from internet"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "rsschool-devops-bastion-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-bastion-sg"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-bastion-sg"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.nat_instance will be created
  + resource "aws_security_group" "nat_instance" {
      + arn                    = (known after apply)
      + description            = "Security group for NAT instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.20.0/24",
                ]
              + description      = "All TCP from private subnets"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.20.0/24",
                ]
              + description      = "HTTP from private subnets"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.20.0/24",
                ]
              + description      = "HTTPS from private subnets"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH from bastion"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "rsschool-devops-nat-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-nat-sg"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-nat-sg"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.private_instances will be created
  + resource "aws_security_group" "private_instances" {
      + arn                    = (known after apply)
      + description            = "Security group for instances in private subnets"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "All UDP from VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "All traffic from VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "ICMP from VPC"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH from bastion"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "rsschool-devops-private-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-sg"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-sg"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-subnet-1"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-subnet-1"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-subnet-2"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-private-subnet-2"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-subnet-1"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-subnet-1"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-subnet-2"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-public-subnet-2"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
          + "Type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-vpc"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-vpc"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_2"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_instance_id                 = (known after apply)
  + bastion_private_ip                  = (known after apply)
  + bastion_public_ip                   = (known after apply)
  + bastion_security_group_id           = (known after apply)
  + internet_gateway_id                 = (known after apply)
  + nat_instance_id                     = (known after apply)
  + nat_instance_private_ip             = (known after apply)
  + nat_instance_public_ip              = (known after apply)
  + nat_security_group_id               = (known after apply)
  + private_instances_security_group_id = (known after apply)
  + private_route_table_ids             = [
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_cidrs                = [
      + "10.0.10.0/24",
      + "10.0.20.0/24",
    ]
  + private_subnet_ids                  = [
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_id               = (known after apply)
  + public_subnet_cidrs                 = [
      + "10.0.1.0/24",
      + "10.0.2.0/24",
    ]
  + public_subnet_ids                   = [
      + (known after apply),
      + (known after apply),
    ]
  + ssh_connection_commands             = {
      + bastion_ssh     = (known after apply)
      + nat_via_bastion = (known after apply)
    }
  + vpc_cidr_block                      = "10.0.0.0/16"
  + vpc_id                              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @LordOfTheVillage, Action: `pull_request`, Workflow: `Terraform CI/CD`*